export const spendingCategories = [
  '🍔',
  '🍕',
  '🍣',
  '🍜',
  '🍲', // Food & Dining
  '🛒',
  '🥦',
  '🍎',
  '🥚',
  '🥖', // Groceries
  '🚗',
  '🚌',
  '🚆',
  '✈️',
  '⛽', // Transportation
  '🏠',
  '🏡',
  '🏢',
  '🔑',
  '🏘️', // Housing
  '💡',
  '🔥',
  '💧',
  '📡',
  '📞', // Utilities
  '🎬',
  '🎮',
  '🎤',
  '🎧',
  '🎭', // Entertainment
  '🏥',
  '💊',
  '🩺',
  '👩‍⚕️',
  '🦷', // Healthcare
  '🛡️',
  '💇‍♀️',
  '💆‍♂️',
  '🛀',
  '🧴',
  '🧼', // Personal Care
  '👗',
  '👚',
  '👖',
  '👠',
  '👟', // Clothing
  '📚',
  '📝',
  '🏫',
  '🎓', // Education
  '💰',
  '📈',
  '🏦',
  '💳', // Savings & Investments
  '🎁',
  '🎉',
  '🎈',
  '🙏', // Gifts & Donations
  '🌍',
  '🗺️',
  '🏝️',
  '🚢', // Travel
  '🐶',
  '🐱',
  '🐾',
  '🐦', // Pets
];
